       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBL0001.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT FNAMES ASSIGN TO 'FNAMES'
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT LNAMES ASSIGN TO 'LNAMES'
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT COMBINED ASSIGN TO 'COMBINED'
               ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD FNAMES.
       01 FNAME-REC PIC X(20).
       FD LNAMES.
       01 LNAME-REC PIC X(20).
       FD COMBINED.
       01 COMBINED-REC PIC X(40).
       WORKING-STORAGE SECTION.
       01 EOF-FNAMES PIC X VALUE 'N'.
       01 EOF-LNAMES PIC X VALUE 'N'.
       PROCEDURE DIVISION.
           OPEN INPUT FNAMES LNAMES
                OUTPUT COMBINED
           PERFORM UNTIL EOF-FNAMES = 'Y' OR EOF-LNAMES = 'Y'
               READ FNAMES AT END MOVE 'Y' TO EOF-FNAMES
               READ LNAMES AT END MOVE 'Y' TO EOF-LNAMES
               IF EOF-FNAMES NOT = 'Y' AND EOF-LNAMES NOT = 'Y'
                   STRING FNAME-REC DELIMITED BY SPACE
                          " " DELIMITED BY SIZE
                          LNAME-REC DELIMITED BY SPACE
                          INTO COMBINED-REC
                   WRITE COMBINED-REC
               END-IF
           END-PERFORM
           CLOSE FNAMES LNAMES COMBINED
           STOP RUN.
